# SelectTreeControlItem

## Description
Selects the specified tree control item.

```pascal
PROCEDURE SelectTreeControlItem(
				nDialogID    : LONGINT;
				nComponentID : LONGINT;
				nItemID      : INTEGER);
```

```python
def vs.SelectTreeControlItem(nDialogID, nComponentID, nItemID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|nItemID|INTEGER|   |

## Version
Availability: from VectorWorks12.5

## Category
* Dialogs - Modern